#+TITLE: Ejercicios del Tema 7 - Asignación dinámica de memoria
#+SUBTITLE: Asignación dinámica de memoria
#+AUTHOR: 
#+DATE: 
#+SETUPFILE: config.org
#+PROPERTY: header-args :exports none
#+EXPORT_FILE_NAME: ejercicios_tema7_asig.pdf


* Máximo, mínimo y promedio de variables

El fichero =aranjuez.csv= es un fichero que almacena valores numéricos en formato CSV (valores separados por comas). Contiene 4 columnas (variables) y muchas filas.

Suponga que no puede conocer a priori el número de filas del fichero.

Escribe un programa que lea este fichero almacenando el contenido de cada columna en un vector. A continuación, el programa debe calcular el valor máximo, mínimo y promedio de cada vector empleando una función separada para cada cálculo (/revisa el ejercicio "Máximo, mínimo y promedio de una colección de números" del capítulo 4/). Finalmente, el programa mostrará el resultado en pantalla y escribirá estos cálculos en un fichero con un formato similar al siguiente:

| Variable | Min | Max | Media |
| Temp     | XX  | XX  | XX    |
| Humedad  | XX  | XX  | XX    |
| Viento   | XX  | XX  | XX    |
| Rad      | XX  | XX  | XX    |


#+BEGIN_SRC C
#include <stdio.h>
#include <stdlib.h>

double maximo(double x[], int n);
double minimo(double x[], int n);
double promedio(double x[], int n);

int main()
{
  FILE *pf, *wf;
  int i, N;
  char c;
  // Defino un vector para cada variable a leer del fichero
  double *TempAvg, *HumidAvg, *WindAvg,*Radiation;
  double minTa, minH, minW, minR;
  double maxTa, maxH, maxW, maxR;
  double promTa, promH, promW, promR;
  
  pf = fopen("aranjuez.csv", "r");
  if (pf == NULL)
  {
    printf("Error al abrir el fichero");
    return -1;
  }
  else
  {
    //Contamos el número de líneas
    while(fscanf(pf, "%c", &c) != EOF)
    {
      if(c == '\n')
      {
        N++;
      }
      
    }                

    //Volvemos a la posición inicial del fichero
    fseek(pf, 0, SEEK_SET);

    //Reservamos memoria para cada puntero
    TempAvg = malloc(sizeof(double) * N);
    HumidAvg = malloc(sizeof(double) * N);
    WindAvg = malloc(sizeof(double) * N);
    Radiation = malloc(sizeof(double) * N);

    if (TempAvg == NULL || HumidAvg == NULL || WindAvg == NULL || Radiation == NULL)
	  {  
	    printf("Error de memoria.\n");
	    exit(-1);
	  }
    
    // Leemos el fichero línea a línea
    for (i = 0; i < N; i++)
    {
      // El formato es de números separados por comas
	    fscanf(pf, "%lf,%lf,%lf,%lf", &TempAvg[i], &HumidAvg[i], &WindAvg[i], &Radiation[i]);
	  }
    // Cerramos el fichero
    fclose(pf);
    
    // Calcula el minimo, maximo y promedio usando las funciones
    minTa = minimo(TempAvg, N);
    maxTa = maximo(TempAvg, N);
    promTa = promedio(TempAvg, N);

    minH = minimo(HumidAvg, N);
    maxH = maximo(HumidAvg, N);
    promH = promedio(HumidAvg, N);

    minW = minimo(WindAvg, N);
    maxW = maximo(WindAvg, N);
    promW = promedio(WindAvg, N);

    minR = minimo(Radiation, N);
    maxR = maximo(Radiation, N);
    promR = promedio(Radiation, N);

    // Mostramos resultados
    printf("Variable: \t Min \t Max \t Prom \n");
    printf("Temp: \t %lf \t %lf \t %lf \n", minTa, maxTa, promTa);
    printf("Humedad: \t %lf \t %lf \t %lf \n", minH, maxH, promH);
    printf("Viento: \t %lf \t %lf \t %lf \n", minW, maxW, promW);
    printf("Radiacion: \t %lf \t %lf \t %lf \n", minR, maxR, promR);

    // Escribimos fichero
    wf = fopen("resumen.txt", "w");
      
    fprintf(wf, "Variable: \t Min \t Max \t Prom \n");
    fprintf(wf, "Temp: \t %lf \t %lf \t %lf \n", minTa, maxTa, promTa);
    fprintf(wf, "Humedad: \t %lf \t %lf \t %lf \n", minH, maxH, promH);
    fprintf(wf, "Viento: \t %lf \t %lf \t %lf \n", minW, maxW, promW);
    fprintf(wf, "Radiacion: \t %lf \t %lf \t %lf \n", minR, maxR, promR);
    
    fclose(wf);
      
    return 0;
  }
}

double maximo(double x[], int n)
{
  int i;
  //El maximo inicial es el primer elemento
  double mx = x[0]; 

  // Busca en el vector algún valor mayor
  for (i = 1; i < n; i++)
  {
    if (x[i] > mx)
    {
      // y lo sustituye si lo encuentra      
      mx = x[i]; 
    } 
  }
    
  return mx;
}

double minimo(double x[], int n)
{
  int i;
  double mn = x[0];

  for (i = 1; i < n; i++)
  {
    if (x[i] < mn) 
    {
      mn = x[i];
    }
  }
    
  return mn;
}

double promedio(double x[], int n)
{
  int i;
  double media = 0.0;

  for (i = 0; i < n; i++)
  {
    media = media + x[i];
  }
    
  return media / n;
}

#+END_SRC

#+RESULTS:
| Variable:  |    Min |   Max |      Prom |
| Temp:      | -5.309 | 30.68 | 14.404856 |
| Humedad:   |  19.89 | 100.0 |  62.16039 |
| Viento:    |    0.0 |  8.26 |  1.170742 |
| Radiacion: |    0.0 | 32.74 | 16.666658 |



